{
  "format": "graph-model",
  "generatedBy": "2.10.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "signature": {
    "inputs": {
      "conv2d_input": {
        "name": "conv2d_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "32" },
            { "size": "32" },
            { "size": "1" }
          ]
        }
      }
    },
    "outputs": {
      "dense_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "13" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "1" },
                  { "size": "32" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Const",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1024" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "13" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "13" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "conv2d_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "32" },
                { "size": "32" },
                { "size": "1" }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Relu",
        "op": "_FusedConv2D",
        "input": [
          "conv2d_input",
          "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "padding": { "s": "VkFMSUQ=" },
          "use_cudnn_on_gpu": { "b": true },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 },
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
          "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "epsilon": { "f": 0.0 },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu"],
        "attr": {
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
          "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d_2/Relu",
          "StatefulPartitionedCall/sequential/flatten/Const"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/flatten/Reshape",
          "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense/Relu",
          "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential/dense_1/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1087 }
  },
  "weightsManifest": [
    {
      "paths": ["https://download1510.mediafire.com/7t7bekmzk3mg/7mh8nathz2atsmw/group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "shape": [3, 3, 1, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/flatten/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "shape": [1024, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "shape": [64, 13],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
          "shape": [13],
          "dtype": "float32"
        }
      ]
    }
  ]
}
